# Pandas
pandas df and series can access all the functions of numpy arrays, since pandas is built over numpy

In [1]:
import pandas as pd

In [2]:
d = {
    "Country": ["Brazil", "Russia", "India", "China", "South Africa"],
    "Capital": ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
    "Area": [5.616, 20.4, 7.89, 9.5, 12.4]
}

In [4]:
brics = pd.DataFrame(d)
brics

        Country    Capital    Area
0        Brazil   Brasilia   5.616
1        Russia     Moscow  20.400
2         India  New Delhi   7.890
3         China    Beijing   9.500
4  South Africa   Pretoria  12.400

In [5]:
brics.columns

Index(['Country', 'Capital', 'Area'], dtype='object')

In [6]:
brics.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
brics.columns = ["Count", "Cap", "Ar"]

In [9]:
brics

          Count        Cap      Ar
0        Brazil   Brasilia   5.616
1        Russia     Moscow  20.400
2         India  New Delhi   7.890
3         China    Beijing   9.500
4  South Africa   Pretoria  12.400

In [12]:
brics.index = ["A", "B", "C", "D", "E"]

In [13]:
brics

          Count        Cap      Ar
A        Brazil   Brasilia   5.616
B        Russia     Moscow  20.400
C         India  New Delhi   7.890
D         China    Beijing   9.500
E  South Africa   Pretoria  12.400

In [16]:
brics.columns[1] = "Capital"

TypeError: Index does not support mutable operations

In [19]:
l = list(brics.columns)

In [21]:
l[1] = "Capital"
l

['Count', 'Capital', 'Ar']

In [22]:
brics.columns = l

In [23]:
brics

          Count    Capital      Ar
A        Brazil   Brasilia   5.616
B        Russia     Moscow  20.400
C         India  New Delhi   7.890
D         China    Beijing   9.500
E  South Africa   Pretoria  12.400

In [24]:
brics.reset_index()

  index         Count    Capital      Ar
0     A        Brazil   Brasilia   5.616
1     B        Russia     Moscow  20.400
2     C         India  New Delhi   7.890
3     D         China    Beijing   9.500
4     E  South Africa   Pretoria  12.400

In [25]:
brics

          Count    Capital      Ar
A        Brazil   Brasilia   5.616
B        Russia     Moscow  20.400
C         India  New Delhi   7.890
D         China    Beijing   9.500
E  South Africa   Pretoria  12.400

In [27]:
brics=brics.reset_index()

In [28]:
brics

  index         Count    Capital      Ar
0     A        Brazil   Brasilia   5.616
1     B        Russia     Moscow  20.400
2     C         India  New Delhi   7.890
3     D         China    Beijing   9.500
4     E  South Africa   Pretoria  12.400

In [30]:
brics.reset_index(inplace = True)
#inplace = True will make the changes in place in the variable. then assignment will not be required.

In [31]:
brics

   level_0 index         Count    Capital      Ar
0        0     A        Brazil   Brasilia   5.616
1        1     B        Russia     Moscow  20.400
2        2     C         India  New Delhi   7.890
3        3     D         China    Beijing   9.500
4        4     E  South Africa   Pretoria  12.400

In [34]:
brics.drop(["level_0", "index"], axis = 1, inplace = True)

In [35]:
brics

          Count    Capital      Ar
0        Brazil   Brasilia   5.616
1        Russia     Moscow  20.400
2         India  New Delhi   7.890
3         China    Beijing   9.500
4  South Africa   Pretoria  12.400

In [36]:
brics = brics.reset_index(inplace = True) #returns null

In [37]:
brics

----

In [38]:
brics = pd.DataFrame(d)

In [39]:
brics

        Country    Capital    Area
0        Brazil   Brasilia   5.616
1        Russia     Moscow  20.400
2         India  New Delhi   7.890
3         China    Beijing   9.500
4  South Africa   Pretoria  12.400

In [40]:
brics.reset_index(drop = True)

        Country    Capital    Area
0        Brazil   Brasilia   5.616
1        Russia     Moscow  20.400
2         India  New Delhi   7.890
3         China    Beijing   9.500
4  South Africa   Pretoria  12.400

In [42]:
brics.reset_index()

   index       Country    Capital    Area
0      0        Brazil   Brasilia   5.616
1      1        Russia     Moscow  20.400
2      2         India  New Delhi   7.890
3      3         China    Beijing   9.500
4      4  South Africa   Pretoria  12.400

In [45]:
brics = brics.reset_index()
brics

   level_0  index       Country    Capital    Area
0        0      0        Brazil   Brasilia   5.616
1        1      1        Russia     Moscow  20.400
2        2      2         India  New Delhi   7.890
3        3      3         China    Beijing   9.500
4        4      4  South Africa   Pretoria  12.400

In [46]:
brics.drop(["level_0", "index"], axis = 1)

        Country    Capital    Area
0        Brazil   Brasilia   5.616
1        Russia     Moscow  20.400
2         India  New Delhi   7.890
3         China    Beijing   9.500
4  South Africa   Pretoria  12.400

In [47]:
brics

   level_0  index       Country    Capital    Area
0        0      0        Brazil   Brasilia   5.616
1        1      1        Russia     Moscow  20.400
2        2      2         India  New Delhi   7.890
3        3      3         China    Beijing   9.500
4        4      4  South Africa   Pretoria  12.400

In [48]:
brics = brics.drop(["level_0", "index"], axis = 1)

In [49]:
brics

        Country    Capital    Area
0        Brazil   Brasilia   5.616
1        Russia     Moscow  20.400
2         India  New Delhi   7.890
3         China    Beijing   9.500
4  South Africa   Pretoria  12.400

In [51]:
brics.drop("Country", axis = 1, inplace = True)

In [52]:
brics

     Capital    Area
0   Brasilia   5.616
1     Moscow  20.400
2  New Delhi   7.890
3    Beijing   9.500
4   Pretoria  12.400

In [55]:
#to drop rows
brics.drop([2, 4], axis= 0, inplace = True)

In [56]:
br = pd.DataFrame(d)

In [57]:
br

        Country    Capital    Area
0        Brazil   Brasilia   5.616
1        Russia     Moscow  20.400
2         India  New Delhi   7.890
3         China    Beijing   9.500
4  South Africa   Pretoria  12.400

In [58]:
a = br.copy()

In [60]:
id(a), id(br)

(140376748429096, 140376749492432)

### Summary functions

In [63]:
br.info() #object indicates characterb

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Country    5 non-null object
Capital    5 non-null object
Area       5 non-null float64
dtypes: float64(1), object(2)
memory usage: 200.0+ bytes

In [68]:
import numpy as np
br.Area[3] = np.NaN

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [69]:
br

        Country    Capital    Area
0        Brazil   Brasilia   5.616
1        Russia     Moscow  20.400
2         India  New Delhi   7.890
3         China    Beijing     NaN
4  South Africa   Pretoria  12.400

In [70]:
br.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Country    5 non-null object
Capital    5 non-null object
Area       4 non-null float64
dtypes: float64(1), object(2)
memory usage: 200.0+ bytes

In [64]:
br.dtypes

Country     object
Capital     object
Area       float64
dtype: object

In [71]:
br.describe() #for all the numerical columns

           Area
count   4.00000
mean   11.57650
std     6.52304
min     5.61600
25%     7.32150
50%    10.14500
75%    14.40000
max    20.40000

In [72]:
br.describe(include="all")

             Country  Capital      Area
count              5        5   4.00000
unique             5        5       NaN
top     South Africa  Beijing       NaN
freq               1        1       NaN
mean             NaN      NaN  11.57650
std              NaN      NaN   6.52304
min              NaN      NaN   5.61600
25%              NaN      NaN   7.32150
50%              NaN      NaN  10.14500
75%              NaN      NaN  14.40000
max              NaN      NaN  20.40000

----

In [79]:
y = br["Country"]
type(y)

pandas.core.series.Series

In [76]:
x = br.Country

In [77]:
type(x)

pandas.core.series.Series

In [80]:
br.Area

0     5.616
1    20.400
2     7.890
3       NaN
4    12.400
Name: Area, dtype: float64

In [82]:
p = br[["Country", "Area"]]
p

        Country    Area
0        Brazil   5.616
1        Russia  20.400
2         India   7.890
3         China     NaN
4  South Africa  12.400

In [83]:
type(p)

pandas.core.frame.DataFrame

In [84]:
q = br[["Area"]]
type(q)

pandas.core.frame.DataFrame

In [86]:
q.shape, br.Area.shape

((5, 1), (5,))

In [87]:
br

        Country    Capital    Area
0        Brazil   Brasilia   5.616
1        Russia     Moscow  20.400
2         India  New Delhi   7.890
3         China    Beijing     NaN
4  South Africa   Pretoria  12.400

In [88]:
br[["Capital", "Area"]]

     Capital    Area
0   Brasilia   5.616
1     Moscow  20.400
2  New Delhi   7.890
3    Beijing     NaN
4   Pretoria  12.400

In [90]:
br.Capital

0     Brasilia
1       Moscow
2    New Delhi
3      Beijing
4     Pretoria
Name: Capital, dtype: object

In [91]:
br["Capital"]

0     Brasilia
1       Moscow
2    New Delhi
3      Beijing
4     Pretoria
Name: Capital, dtype: object

In [92]:
br[["Capital"]]

     Capital
0   Brasilia
1     Moscow
2  New Delhi
3    Beijing
4   Pretoria

In [94]:
br[0:3]

  Country    Capital    Area
0  Brazil   Brasilia   5.616
1  Russia     Moscow  20.400
2   India  New Delhi   7.890

In [96]:
brics = br.copy()

In [97]:
br.index = ["A", "B", "C", "D","E"]

In [98]:
brics

        Country    Capital    Area
0        Brazil   Brasilia   5.616
1        Russia     Moscow  20.400
2         India  New Delhi   7.890
3         China    Beijing     NaN
4  South Africa   Pretoria  12.400

In [99]:
br

        Country    Capital    Area
A        Brazil   Brasilia   5.616
B        Russia     Moscow  20.400
C         India  New Delhi   7.890
D         China    Beijing     NaN
E  South Africa   Pretoria  12.400

In [100]:
br[:3] #retreives row numbers 0,1,2

  Country    Capital    Area
A  Brazil   Brasilia   5.616
B  Russia     Moscow  20.400
C   India  New Delhi   7.890

In [101]:
br[0] #you have to give only the slices for the rows

KeyError: 0

In [102]:
br[:1] #retreives row number 0

  Country   Capital   Area
A  Brazil  Brasilia  5.616

In [103]:
br[::-1]

        Country    Capital    Area
E  South Africa   Pretoria  12.400
D         China    Beijing     NaN
C         India  New Delhi   7.890
B        Russia     Moscow  20.400
A        Brazil   Brasilia   5.616

In [104]:
#how to re-arrange the columns
br[["Area", "Capital", "Country"]]

     Area    Capital       Country
A   5.616   Brasilia        Brazil
B  20.400     Moscow        Russia
C   7.890  New Delhi         India
D     NaN    Beijing         China
E  12.400   Pretoria  South Africa

In [105]:
br[::-2]

        Country    Capital    Area
E  South Africa   Pretoria  12.400
C         India  New Delhi   7.890
A        Brazil   Brasilia   5.616

In [106]:
br.Country == "India"

A    False
B    False
C     True
D    False
E    False
Name: Country, dtype: bool

In [107]:
br[br.Country == "India"]

  Country    Capital  Area
C   India  New Delhi  7.89

In [110]:
br[br.Area>10]

        Country   Capital  Area
B        Russia    Moscow  20.4
E  South Africa  Pretoria  12.4

In [112]:
br[:2, ["Country"]]

TypeError: '(slice(None, 2, None), ['Country'])' is an invalid key

#### to include the rows as well as columns, we have to use loc / iloc commands

### Loc fn to retrieve the row by row indices and the column names

In [113]:
br

        Country    Capital    Area
A        Brazil   Brasilia   5.616
B        Russia     Moscow  20.400
C         India  New Delhi   7.890
D         China    Beijing     NaN
E  South Africa   Pretoria  12.400

In [114]:
br.loc['A', "Country"]

'Brazil'

In [115]:
br.loc[["A", "B", "C"] , ["Country", "Capital"]]

  Country    Capital
A  Brazil   Brasilia
B  Russia     Moscow
C   India  New Delhi

In [117]:
br.loc["A": "C", "Country":"Area"]

  Country    Capital    Area
A  Brazil   Brasilia   5.616
B  Russia     Moscow  20.400
C   India  New Delhi   7.890

In [118]:
br.loc[:, ["Country", "Area"]]

        Country    Area
A        Brazil   5.616
B        Russia  20.400
C         India   7.890
D         China     NaN
E  South Africa  12.400

In [119]:
br.loc["B":"D", :]

  Country    Capital   Area
B  Russia     Moscow  20.40
C   India  New Delhi   7.89
D   China    Beijing    NaN

In [120]:
br.loc["D":"B":-1, :]

  Country    Capital   Area
D   China    Beijing    NaN
C   India  New Delhi   7.89
B  Russia     Moscow  20.40

In [125]:
br.loc[br.Area>10, "Country"] #retrieves a series

B          Russia
E    South Africa
Name: Country, dtype: object

In [124]:
br.loc[br.Area>10, ["Country"]] #retrieves df

        Country
B        Russia
E  South Africa